{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "SchemaStore.nvim": {
      "src": "https://github.com/b0o/SchemaStore.nvim"
    },
    "blink-emoji.nvim": {
      "src": "https://github.com/moyiz/blink-emoji.nvim"
    },
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp",
      "version": "1.0.0 - 2.0.0"
    },
    "blink.indent": {
      "src": "https://github.com/saghen/blink.indent"
    },
    "codediff.nvim": {
      "src": "https://github.com/esmuellert/codediff.nvim"
    },
    "colorful-menu.nvim": {
      "src": "https://github.com/xzbdmw/colorful-menu.nvim"
    },
    "conflict-marker.nvim": {
      "src": "https://github.com/Tronikelis/conflict-marker.nvim"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "fzf": {
      "src": "https://github.com/junegunn/fzf"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua"
    },
    "grug-far.nvim": {
      "src": "https://github.com/MagicDuck/grug-far.nvim"
    },
    "leetcode.nvim": {
      "src": "https://github.com/kawre/leetcode.nvim"
    },
    "loupe": {
      "src": "https://github.com/wincent/loupe"
    },
    "markdown-plus.nvim": {
      "src": "https://github.com/YousefHadder/markdown-plus.nvim"
    },
    "mdx.nvim": {
      "src": "https://github.com/davidmh/mdx.nvim"
    },
    "mini.nvim": {
      "src": "https://github.com/nvim-mini/mini.nvim"
    },
    "none-ls.nvim": {
      "src": "https://github.com/nvimtools/none-ls.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs"
    },
    "nvim-bqf": {
      "src": "https://github.com/kevinhwang91/nvim-bqf"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-navic": {
      "src": "https://github.com/SmiteshP/nvim-navic"
    },
    "nvim-tmux-navigation": {
      "src": "https://github.com/alexghergh/nvim-tmux-navigation"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'main'"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag"
    },
    "nvim-ts-context-commentstring": {
      "src": "https://github.com/JoosepAlviste/nvim-ts-context-commentstring"
    },
    "obsidian.nvim": {
      "src": "https://github.com/obsidian-nvim/obsidian.nvim",
      "version": ">=0.0.0"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "outline.nvim": {
      "src": "https://github.com/hedyhli/outline.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "rainbow-delimiters.nvim": {
      "src": "https://github.com/HiPhish/rainbow-delimiters.nvim"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim"
    },
    "sidekick.nvim": {
      "src": "https://github.com/folke/sidekick.nvim"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "venn.nvim": {
      "src": "https://github.com/jbyuki/venn.nvim"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-github-hub": {
      "src": "https://github.com/jez/vim-github-hub"
    },
    "vim-kitty": {
      "src": "https://github.com/fladson/vim-kitty"
    },
    "vim-repeat": {
      "src": "https://github.com/tpope/vim-repeat"
    },
    "vim-rhubarb": {
      "src": "https://github.com/tpope/vim-rhubarb"
    },
    "zk-nvim": {
      "src": "https://github.com/zk-org/zk-nvim"
    }
  }
}
