# vim:ft=ruby:

cask_args appdir: '/Applications'

tap "ahmedelgabri/homebrew-battery"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/versions"
tap "neomutt/homebrew-neomutt"
tap "tavianator/tap"
tap "universal-ctags/universal-ctags"

brew "git"
brew "python"
brew "python2" # do I need it anymore?
# brew "ledger"
brew "asciinema"
brew "ahmedelgabri/battery/battery", args: ["HEAD"]
brew "bitlbee", restart_service: true
brew "cloc"
brew "clojure"
brew "coreutils"
brew "curl"
brew "editorconfig"
brew "exiftool"
brew "figlet"
brew "findutils"
brew "isync", args: ["with-berkeley-db"]
brew "gawk"
brew "gnu-sed", args: ["with-default-names"]
brew "gnupg"
brew "gpg-agent"
brew "heroku"
brew "highlight"
brew "htop"
brew "httpie"
brew "hub"
brew "jrnl"
brew "lbdb"
brew "loc"
brew "msmtp"
brew "mpv", args: ["with-bundle"]
brew "ncdu"
brew "neofetch"
brew "neomutt/homebrew-neomutt/neomutt", args: ["with-gpgme", "with-notmuch-patch", "with-lua"]
brew "neovim"
brew "newsboat"
brew "node"
brew "node-build"
brew "offlineimap"
brew "openssl"
brew "pandoc"
brew "pinentry-mac"
brew "proselint"
brew "ranger"
brew "ripgrep"
brew "rtv"
brew "ruby"
brew "task"
brew "tldr"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "urlview"
brew "vim", args: ["with-lua", "with-python3", "with-override-system-vi"]
brew "weechat", args: ["with-perl", "with-python", "with-ruby", "with-lua", "with-curl"]
brew "w3m"
brew "wget"
brew "yarn"
brew "zsh"
brew "ghc"
brew "cabal-install"
brew "haskell-stack"
brew "graphviz"

cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "arq"
cask "box-sync"
cask "dayone-cli"
cask "keybase"
cask "kitty"
cask "firefox"
cask "caskroom/versions/firefoxdeveloperedition"
cask "caskroom/versions/firefoxnightly"
cask "flux"
cask "caskroom/fonts/font-droid-sans-mono-for-powerline"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-hasklig"
cask "caskroom/fonts/font-inconsolata-g-for-powerline"
cask "caskroom/fonts/font-iosevka"
cask "caskroom/fonts/font-iosevka-nerd-font"
cask "caskroom/fonts/font-meslo-for-powerline"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-ibm-plex"
cask "google-chrome"
cask "caskroom/versions/google-chrome-canary"
# cask "gpgtools"
cask "hammerspoon"
cask "imagealpha"
cask "imageoptim"
cask "caskroom/versions/iterm2-nightly"
cask "launchcontrol"
cask "licecap"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "rescuetime"
cask "sequel-pro"
cask "sketch"
cask "skype"
cask "slack"
cask "soda-player"
cask "transmission"
cask "transmit"
cask "caskroom/versions/visual-studio-code-insiders"
cask "vlc"
cask "viscosity"
cask "webpquicklook"
cask "whatsapp"

# mas "Day One", id: 1055511498
# mas "Guidance", id: 412759995
# mas "Irvue", id: 1039633667
# mas "Keynote", id: 409183694
# mas "Sip", id: 507257563
# mas "The Unarchiver", id: 425424353
# mas "Transmit", id: 403388562
# mas "Tweetbot", id: 557168941
