# vim:ft=ruby:
# {{ ansible_managed }}

cask_args appdir: '/Applications'

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "neomutt/homebrew-neomutt"
tap "tavianator/tap"
tap "universal-ctags/universal-ctags"
tap "sachaos/todoist"
tap "dbcli/tap"

# Core
brew "openssl"
brew "git"
brew "python"
brew "python@2"
brew "gawk"
brew "gnu-sed"
brew "coreutils"
brew "findutils"
brew "curl"
brew "wget"
brew "pinentry-mac"
brew "gnupg"
brew "zsh"
brew "transcrypt"

# Languages
brew "node"
brew "n"
brew "yarn"
brew "ruby"

# Core utils
brew "htop"
brew "ncdu"
brew "ripgrep"
brew "pandoc"
brew "urlview"
brew "rename"
brew "tig"
brew "diff-so-fancy"
brew "fd"
brew "jq"
brew "yq"
brew "par"
brew "w3m"
brew "cloc"
brew "loc"
brew "tokei"
brew "lf"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Core apps
brew "neovim", args: ["HEAD"]
brew "newsboat"
# Mail
brew "isync"
brew "lbdb"
brew "msmtp"
brew "neomutt/homebrew-neomutt/neomutt", args: ["with-gpgme", "with-notmuch-patch", "with-lua"]
# End Mail
brew "tmux", args: ["HEAD"]
brew "vim"
brew "weechat" # , args: ["with-curl"]
brew "todoist"

# Nice to have
brew "graphviz"
brew "asciinema"
brew "editorconfig"
brew "exiftool"
brew "figlet"
brew "hyperfine"
brew "neofetch"
brew "proselint"
brew "task"
brew "tldr"
brew "bat"
brew "lsd"
brew "shellcheck"
brew "shfmt" # Doesn't work with zsh, only sh & bash
brew "grip" # Markdown previewer
brew "nnn"
brew "pass"
brew "yamllint"
brew "streamlink"

cask "alacritty"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "box-sync"
cask "corelocationcli"
cask "db-browser-for-sqlite"
cask "keybase"
cask "kitty"
cask "brave-browser"
cask "figma"
cask "firefox"
cask "caskroom/versions/firefox-nightly"
cask "flux"
cask "google-chrome"
cask "caskroom/versions/google-chrome-canary"
cask "hammerspoon"
cask "imageoptim"
cask "launchcontrol"
cask "kap"
cask "mpv"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "sequel-pro"
cask "sketch"
cask "caskroom/versions/visual-studio-code-insiders"
cask "webpquicklook"
cask "zoomus"

# mas "Guidance", id: 412759995
# mas "Sip", id: 507257563
# mas "The Unarchiver", id: 425424353
# mas "Tweetbot", id: 557168941
{% if 'personal' in group_names %}
# Languages
cask "adoptopenjdk8"
brew "clojure"
brew "leiningen"
brew "candid82/brew/joker"
brew "borkdude/brew/clj-kondo"
brew "ghc"
brew "cabal-install"
brew "haskell-stack"
brew "pipenv"
brew "elm"
# I install rust from https://www.rust-lang.org/en-US/install.html
# check Makefile

# Core apps
brew "youtube-dl"

# Nice to have
# brew "ledger"

cask "1password-cli"
cask "arq"
cask "dayone-cli"
cask "iina"
cask "skype"
cask "transmission"
cask "transmit"
cask "vlc"
cask "viscosity"

# mas "Day One", id: 1055511498
# mas "Irvue", id: 1039633667
# mas "Keynote", id: 409183694
{% endif %}
{% if 'work' in group_names %}
# tap "exolnet/homebrew-deprecated"
#
# brew "php@5.6"
# brew "go-jira"
# brew "circleci"
# brew "composer"
# brew "pkg-config"
# brew "libmemcached"
# brew "kubernetes-helm"
# brew "kubectl"
#
# cask "vagrant"
# cask "docker"
# cask "virtualbox"
# cask "google-cloud-sdk"
# cask "minikube"
{% endif %}
